thorrak/brewpi-esp8266/PiLink.cpp
/*
 * Copyright 2012-2013 BrewPi/Elco Jacobs.
 * Copyright 2013 Matthew McGowan.
 *
 * This file is part of BrewPi.
 * 
 * BrewPi is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 * 
 * BrewPi is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 * 
 * You should have received a copy of the GNU General Public License
 * along with BrewPi.  If not, see <http://www.gnu.org/licenses/>.
 */

#include "Brewpi.h"
#include <stdarg.h>

#include "stddef.h"
#include "PiLink.h"

#include "Version.h"
#include "TempControl.h"
#include "Display.h"
#include "JsonKeys.h"
#include "Ticks.h"
#include "Brewpi.h"
#include "EepromManager.h"
#include "EepromFormat.h"
#include "SettingsManager.h"
#include "Buzzer.h"
#include "Display.h"

#ifdef ESP8266_WiFi
#include <ESP8266WiFi.h>          //ESP8266 Core WiFi Library
#endif

#ifdef ARDUINO
#ifndef ESP8266
#include "util/delay.h"
#endif
#endif

#if BREWPI_SIMULATE
#include "Simulator.h"
#endif
//#include <VM_DBG/VM_DBG.h>
 // Rename Serial to piStream, to abstract it for later platform independence

#if BREWPI_EMULATE
	class MockSerial : public Stream
	{
		public:
		void print(char c) {}
		void print(const char* c) {}
		void printNewLine() {}
                void println() {}
		int read() { return -1; }
		int available() { return -1; }
		void begin(unsigned long) {}
		size_t write(uint8_t w) { return 1; }
		int peek() { return -1; }
		void flush() { };			
		operator bool() { return true; }
	};

	static MockSerial mockSerial;
	#define piStream mockSerial
#elif !defined(ARDUINO)
        StdIO stdIO;
        #define piStream stdIO
#elif defined(ESP8266_WiFi)
/*class TelnetSerial : public Stream
{
private:
	String inputBuf = "";
	String outputBuf = "";

public:
	void print(char c) {}
	void print(const char* c) {}
	void printNewLine() {}
	void println() {}

	int read() { 
		return -1; 
	}

	int available() { return -1; }
	void begin(unsigned long) {}
	size_t write(uint8_t w) { return 1; }
	int peek() { return -1; }
	void flush() { };

	void bufferFromConnected() {
		uint8_t i;
		//check clients for data
		for (i = 0; i < MAX_SRV_CLIENTS; i++) {
			if (serverClients[i] && serverClients[i].connected()) {
				if (serverClients[i].available()) {
					//get data from the telnet client and push it to the UART
					while (serverClients[i].available())
						inputBuf.concat(serverClients[i].read());
				}
			}
		}
		nukeBufferIfDisconneted();
		return;
	}

	void nukeBufferIfDisconneted() {
		uint8_t i;
		bool clientConnected = false;
		for (i = 0; i < MAX_SRV_CLIENTS; i++)
			if (serverClients[i] && serverClients[i].connected())
				clientConnected = true;

		if (!clientConnected) {
			// Nuke the buffers if no clients are connected
			inputBuf = "";
			outputBuf = "";
		}
	}

	operator bool() { return true; }
};*/

//static TelnetSerial telnetSerial;
//#define piStream telnetSerial

// Just use the serverClient object as it supports all the same functions as Serial
extern WiFiServer server;
extern WiFiClient serverClient;
#define piStream serverClient

#else
// Not using ESP8266 WiFi
#define piStream Serial
#endif

bool PiLink::firstPair;
char PiLink::printfBuff[PRINTF_BUFFER_SIZE];
#ifdef BUFFER_PILINK_PRINTS
String PiLink::printBuf;
#endif

void PiLink::init(void){
#ifndef ESP8266_WiFi
piStream.begin(57600);
#endif

#ifdef BUFFER_PILINK_PRINTS
printBuf.reserve(2048); // Reserve 2kb for our string (waaaay more than we need, and we have space on the ESP!)
printBuf = "";
#endif

}

#ifdef ESP8266
void formatStandardAnnotation(String &annotation, const char* str_1, const char* str_2, const char* str_3);
#endif

extern void handleReset();

// create a printf like interface to the Arduino Serial function. Format string stored in PROGMEM
void PiLink::print_P(const char *fmt, ... ){
	va_list args;
	va_start (args, fmt );
	vsnprintf_P(printfBuff, PRINTF_BUFFER_SIZE, fmt, args);
//	vsnprintf(printfBuff, PRINTF_BUFFER_SIZE, fmt, args);
	va_end (args);
#ifdef ESP8266_WiFi
	if (piStream && piStream.connected()) { // if WiFi client connected
#ifdef BUFFER_PILINK_PRINTS
		printBuf += printfBuff;
#else
		piStream.print(printfBuff);
#endif
	}
#else
	if(piStream){ // if Serial connected (on Leonardo)
		piStream.print(printfBuff);
	}
#endif
}

// create a printf like interface to the Arduino Serial function. Format string stored in RAM
void PiLink::print(char *fmt, ... ){
	va_list args;
	va_start (args, fmt );
	vsnprintf(printfBuff, PRINTF_BUFFER_SIZE, fmt, args);
	va_end (args);
#ifdef ESP8266_WiFi
	if (piStream && piStream.connected()) { // if WiFi client connected
#ifdef BUFFER_PILINK_PRINTS
		printBuf += printfBuff;
#else
		piStream.print(printfBuff);
#endif
	}
#else
	if (piStream) { // if Serial connected (on Leonardo)
		piStream.print(printfBuff);
	}
#endif
}

#ifdef ESP8266
void PiLink::print(char out) {
#ifdef ESP8266_WiFi
	if (piStream && piStream.connected()) { // if WiFi client connected

#ifdef BUFFER_PILINK_PRINTS
		printBuf += out;
#else
		piStream.print(out);
#endif
	}
#else
	if (piStream) { // if Serial connected (on Leonardo)
		piStream.print(out);
	}
#endif
}
#endif

void PiLink::printNewLine(){
#ifdef ESP8266_WiFi
	if (piStream && piStream.connected()) { // if WiFi client connected
#ifdef BUFFER_PILINK_PRINTS
		if (printBuf.length() > 0)
			piStream.print(printBuf);
		printBuf = "";
#endif
		piStream.println();
		yield();
		delay(100); // Give the controller enough time to transmit the full message
	}
#else
	if (piStream) { // if Serial connected (on Leonardo)
		piStream.println();
	}
#endif
}

#if BREWPI_EEPROM_HELPER_COMMANDS
void PiLink::printNibble(uint8_t n)
{
	n &= 0xF;
#ifdef ESP8266_WiFi
	if (piStream && piStream.connected()) { // if WiFi client connected
		print((char)(n >= 10 ? n - 10 + 'A' : n + '0'));
	}
#else
	if (piStream) { // if Serial connected (on Leonardo)
		print((char)(n >= 10 ? n - 10 + 'A' : n + '0'));
	}
#endif
}
#endif

// Trying to enforce that the only thing to talk to piStream is piLink
int PiLink::read() {
	return piStream.read();
}

