thorrak/brewpi-esp8266/PiLink.cpp
};

void PiLink::sendJsonValues(char responseType, const JsonOutput* /*PROGMEM*/ jsonOutputMap, uint8_t mapCount) {
	printResponse(responseType);
	while (mapCount-->0) {
		JsonOutput output;
		memcpy_P(&output, jsonOutputMap++, sizeof(output));
		JsonOutputHandlers[output.handlerOffset](output.key,output.offset);
	}
	sendJsonClose();
}

// Send control constants as JSON string. Might contain spaces between minus sign and number. Python will have to strip these
void PiLink::sendControlConstants(void){
	jsonOutputBase = (uint8_t*)&tempControl.cc;
	sendJsonValues('C', jsonOutputCCMap, sizeof(jsonOutputCCMap)/sizeof(jsonOutputCCMap[0]));	
}

const PiLink::JsonOutput PiLink::jsonOutputCVMap[] PROGMEM = {
	JSON_OUTPUT_CV_MAP(beerDiff, JOCC_TEMP_DIFF),
	JSON_OUTPUT_CV_MAP(diffIntegral, JOCC_TEMP_DIFF),
	JSON_OUTPUT_CV_MAP(beerSlope, JOCC_TEMP_DIFF),
	JSON_OUTPUT_CV_MAP(p, JOCC_FIXED_POINT),
	JSON_OUTPUT_CV_MAP(i, JOCC_FIXED_POINT),
	JSON_OUTPUT_CV_MAP(d, JOCC_FIXED_POINT),
	JSON_OUTPUT_CV_MAP(estimatedPeak, JOCC_TEMP_FORMAT),
	JSON_OUTPUT_CV_MAP(negPeakEstimate, JOCC_TEMP_FORMAT),
	JSON_OUTPUT_CV_MAP(posPeakEstimate, JOCC_TEMP_FORMAT),
	JSON_OUTPUT_CV_MAP(negPeak, JOCC_TEMP_FORMAT),
	JSON_OUTPUT_CV_MAP(posPeak, JOCC_TEMP_FORMAT)	
};

// Send all control variables. Useful for debugging and choosing parameters
void PiLink::sendControlVariables(void){
	jsonOutputBase = (uint8_t*)&tempControl.cv;
	sendJsonValues('V', jsonOutputCVMap, sizeof(jsonOutputCVMap)/sizeof(jsonOutputCVMap[0]));
}

void PiLink::printJsonName(const char * name)
{
	printJsonSeparator();
	print('"');
	print_P(name);
	print("\":");
}

inline void PiLink::printJsonSeparator() {
	print(firstPair ? '{' : ',');	
	firstPair = false;
}

void PiLink::sendJsonPair(const char * name, const char * val){
	printJsonName(name);
	// TODO - Fix this to use PiLink.print in all cases
#ifndef ESP8266
	piStream.print(val);
#else
	print_P(val);
#endif
}

void PiLink::sendJsonPair(const char * name, char val){
	printJsonName(name);
	print('"');
	print(val);
	print('"');
}

void PiLink::sendJsonPair(const char * name, uint16_t val){
	printJsonName(name);	
	print_P(PSTR("%u"), val);
}

void PiLink::sendJsonPair(const char * name, uint8_t val) {
	sendJsonPair(name, (uint16_t)val);
}

int readNext()
{
	uint8_t retries = 0;
	while (piStream.available()==0) {
#ifdef ESP8266
		// changing to delay as delayMicroseconds doesn't yield like delay does
		delay(1);
		yield();
#else
		_delay_us(100);
#endif
		retries++;
		if (retries >= 10) {
			return -1;
		}
	}
	return piLink.read();		
}
/**
 * Parses a token from the piStream.
 * \return true if a token was parsed
 */
bool parseJsonToken(char* val) {
	uint8_t index = 0;
	val[0] = 0;
	bool result = true;
	for(;;) // get value
	{
		int character = readNext();
		if (index==29 || character == '}' || character==-1) {
			result = false;
			break;
		}
		if(character == ',' || character==':')  // end of value
			break;		
		if(character == ' ' || character == '"'){
			; // skip spaces and apostrophes
		}		
		else
			val[index++] = character;
	}
	val[index]=0; // null terminate string
	return result;	
}

void PiLink::parseJson(ParseJsonCallback fn, void* data) 
{
	char key[30];
	char val[30];
	*key = 0;
	*val = 0;
	bool next = true;
	// read first open brace	
	int c = readNext();		
	if (c!='{')
	{
		logErrorInt(ERROR_EXPECTED_BRACKET, c);
		return;
	}
	do {
		next = parseJsonToken(key) && parseJsonToken(val);
		if (val[0] && key[0])
			fn(key, val, data);
	} while (next);
}

void PiLink::receiveJson(void){

	parseJson(&processJsonPair, NULL);	
				
#if !BREWPI_SIMULATE	// this is quite an overhead and not needed for the simulator
	sendControlSettings();	// update script with new settings
	sendControlConstants();
#endif
	return;
}


static const char STR_WEB_INTERFACE[] PROGMEM = "in web interface";
static const char STR_TEMPERATURE_PROFILE[] PROGMEM = "by temperature profile";
static const char STR_MODE[] PROGMEM = "Mode";
static const char STR_BEER_TEMP[] PROGMEM = "Beer temp";
static const char STR_FRIDGE_TEMP[] PROGMEM = "Fridge temp";
static const char STR_FMT_SET_TO[] PROGMEM = "%S set to %s %S";

void PiLink::setMode(const char* val) {
	char mode = val[0];
	tempControl.setMode(mode);
#ifdef ESP8266
	String annotation = "";
	formatStandardAnnotation(annotation, STR_MODE, val, "in web interface");
	printTemperaturesJSON(0, annotation.c_str());
#else
	piLink.printFridgeAnnotation(STR_FMT_SET_TO, STR_MODE, val, STR_WEB_INTERFACE);
#endif
}

void PiLink::setBeerSetting(const char* val) {
#ifdef ESP8266
	String annotation = "";
#endif
	const char* source = NULL;
	temperature newTemp = stringToTemp(val);
	if (tempControl.cs.mode == 'p') {
		if (abs(newTemp - tempControl.cs.beerSetting) > 100) { // this excludes gradual updates under 0.2 degrees
#ifdef ESP8266
			formatStandardAnnotation(annotation, STR_BEER_TEMP, val, "by temperature profile");
#else
			source = STR_TEMPERATURE_PROFILE;
#endif
		}
	} else {
#ifdef ESP8266
		formatStandardAnnotation(annotation, STR_BEER_TEMP, val, "in web interface");
#else
		source = STR_WEB_INTERFACE;
#endif
	}
#ifdef ESP8266
	if (annotation.length() > 0)
		printTemperaturesJSON(annotation.c_str(), 0);
#else
	if (source)
		printBeerAnnotation(STR_FMT_SET_TO, STR_BEER_TEMP, val, source);
#endif
	tempControl.setBeerTemp(newTemp);		
}

//There's some kind of strange bug with the ESP8266 (probably a memory issue) where if I pass STR_WEB_INTERFACE
//as str_3, everything dies. Same with using "printFridgeAnnotation" - Everything dies. 
#ifdef ESP8266
void formatStandardAnnotation(String &annotation, const char* str_1, const char* str_2, const char* str_3) {
	annotation += str_1;
	annotation += " set to ";
	annotation += str_2;
	annotation += " ";
	annotation += str_3;
}
#endif


void PiLink::setFridgeSetting(const char* val) {
	temperature newTemp = stringToTemp(val);
	if(tempControl.cs.mode == 'f'){
#ifdef ESP8266
		String annotation = "";
		formatStandardAnnotation(annotation, STR_FRIDGE_TEMP, val, "in web interface");
		printTemperaturesJSON(0, annotation.c_str());
#else
		printFridgeAnnotation(STR_FMT_SET_TO, STR_FRIDGE_TEMP, val, STR_WEB_INTERFACE);
#endif
	}
	tempControl.setFridgeTemp(newTemp);	
}

void PiLink::setTempFormat(const char* val) {
	tempControl.cc.tempFormat = val[0];
	display.printStationaryText(); // reprint stationary text to update to right degree unit
	eepromManager.storeTempConstantsAndSettings();
}


// todo - move these structs to PROGMEM.
enum FilterType { FAST, SLOW, SLOPE };
enum TempSensorTarget { FRIDGE, BEER };

static uint8_t* const filterSettings[] = {
		&tempControl.cc.fridgeFastFilter,
		&tempControl.cc.fridgeSlowFilter,
		&tempControl.cc.fridgeSlopeFilter,
		&tempControl.cc.beerFastFilter,
		&tempControl.cc.beerSlowFilter,
		&tempControl.cc.beerSlopeFilter		
	};
	
#define MAKE_FILTER_SETTING_TARGET(filterType, sensorTarget)  (void*)(uint8_t(filterType)+uint8_t(sensorTarget)*3)

